{
  "project": "Ownly iOS",
  "branchName": "ralph/ownly-ios-expo-mvp",
  "description": "Build an iOS-only Expo app for Ownly with native iOS UI style, inventory + AI add item + search + marketplace, and Expo Push notifications.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Bootstrap Expo iOS app workspace",
      "description": "As a developer, I need an Expo iOS app scaffold integrated with the existing repository so we can implement features incrementally.",
      "acceptanceCriteria": [
        "Create mobile app scaffold under scripts/ or apps path with Expo + TypeScript and iOS target",
        "Project can run with expo start and open on iOS simulator",
        "Add README section for local mobile setup commands",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Configure Supabase client and environment for mobile",
      "description": "As a developer, I need a typed Supabase client in mobile with environment loading so API calls are consistent with web.",
      "acceptanceCriteria": [
        "Mobile app reads SUPABASE URL and ANON KEY from Expo env config",
        "Create typed Supabase client module for mobile",
        "Missing env vars produce a clear startup error",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Implement mobile auth session persistence",
      "description": "As a user, I want my login session to persist securely on iOS so I do not need to sign in repeatedly.",
      "acceptanceCriteria": [
        "Implement AuthProvider for mobile using Supabase auth state listeners",
        "Use secure storage adapter for session persistence",
        "Unauthenticated users are redirected to auth flow",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Build login, signup, and reset password screens",
      "description": "As a user, I want to authenticate from native iOS screens so I can access my data.",
      "acceptanceCriteria": [
        "Add Login, Signup, and Reset Password screens with validation and loading states",
        "Show server-side auth errors in UI",
        "Successful login routes to authenticated app shell",
        "Typecheck passes",
        "Verify in iOS simulator: auth forms submit and navigation works"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Create iOS-native navigation shell",
      "description": "As a user, I want standard iOS tab and stack navigation so the app feels native.",
      "acceptanceCriteria": [
        "Create bottom tab navigation: Inventory, Add, Search, Marketplace, Settings",
        "Configure stack routes for detail pages under each module",
        "Apply iOS native header/back behavior and safe area handling",
        "Typecheck passes",
        "Verify in iOS simulator: tab switching and push/pop navigation work"
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Implement inventory list with pagination",
      "description": "As a user, I want to browse my inventory with infinite loading so large collections remain usable.",
      "acceptanceCriteria": [
        "Inventory screen fetches non-deleted items for current user with page size",
        "Add loading, empty, and error states",
        "Implement load more behavior when reaching list end",
        "Typecheck passes",
        "Verify in iOS simulator: list loads and paginates"
      ],
      "priority": 6,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Add inventory sort and filter controls",
      "description": "As a user, I want to sort and filter inventory by category/location/expiration so I can find items faster.",
      "acceptanceCriteria": [
        "Add sort options matching web: newest, oldest, name asc/desc, expiring, viewed",
        "Add category and location filters",
        "Filter/sort state is reflected consistently in query calls",
        "Typecheck passes",
        "Verify in iOS simulator: changing controls updates results"
      ],
      "priority": 7,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Build item detail read experience",
      "description": "As a user, I want a detail page for an item so I can view complete metadata and storage location.",
      "acceptanceCriteria": [
        "Create item detail screen with photo, core fields, category, location, tags, and metadata",
        "Display fallback values for optional/null fields",
        "Add navigation entry from inventory list item to detail",
        "Typecheck passes",
        "Verify in iOS simulator: open and close detail page from list"
      ],
      "priority": 8,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-009",
      "title": "Implement item edit/create form",
      "description": "As a user, I want to edit item fields with native controls so I can maintain accurate inventory data.",
      "acceptanceCriteria": [
        "Create reusable form for name, description, quantity, category, location, tags, price, dates, brand/model",
        "Add client validation for required/typed fields",
        "Support both create mode and edit mode",
        "Typecheck passes",
        "Verify in iOS simulator: form interactions and validation messages work"
      ],
      "priority": 9,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-010",
      "title": "Wire create/update/favorite/soft-delete mutations",
      "description": "As a user, I want edits and actions on items to persist immediately so inventory stays current.",
      "acceptanceCriteria": [
        "Create mutations for item create/update/toggle favorite/soft delete",
        "Update list/detail caches after mutation success",
        "Soft delete hides item from default inventory queries",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 10,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-011",
      "title": "Add camera and photo library picker flow",
      "description": "As a user, I want to capture or choose photos from iPhone so I can add items quickly.",
      "acceptanceCriteria": [
        "Implement Add screen actions for camera capture and photo library selection",
        "Handle permissions denied state with clear retry guidance",
        "Preview selected image before upload",
        "Typecheck passes",
        "Verify in iOS simulator: picker flow and preview work"
      ],
      "priority": 11,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-012",
      "title": "Implement mobile image processing pipeline",
      "description": "As a developer, I need consistent image preprocessing so uploads meet storage and AI constraints.",
      "acceptanceCriteria": [
        "Compress/resize images before upload with max size guard",
        "Handle HEIC input by converting or producing actionable error",
        "Generate thumbnail artifact for item record",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 12,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-013",
      "title": "Upload image and call analyze-image edge function",
      "description": "As a user, I want AI to detect item information from my photo so data entry is faster.",
      "acceptanceCriteria": [
        "Upload processed image to Supabase storage path under current user",
        "Invoke analyze-image with storage path payload",
        "Render detected item results with loading and timeout states",
        "Typecheck passes",
        "Verify in iOS simulator: analyze flow reaches result state"
      ],
      "priority": 13,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-014",
      "title": "Implement single-item quick add",
      "description": "As a user, I want one-tap quick add when only one item is detected so I can save time.",
      "acceptanceCriteria": [
        "When one detection exists, show quick add confirmation screen",
        "Quick add creates item with ai_metadata fields populated",
        "On success, inventory cache refreshes and item appears in list",
        "Typecheck passes",
        "Verify in iOS simulator: single-item quick add persists item"
      ],
      "priority": 14,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-015",
      "title": "Implement multi-item selection and batch save",
      "description": "As a user, I want to select multiple detected objects from one photo so I can add them efficiently.",
      "acceptanceCriteria": [
        "When multiple detections exist, show selectable results list/grid",
        "Allow batch save and sequential edit flow",
        "Persist source_batch_id for items from the same photo",
        "Typecheck passes",
        "Verify in iOS simulator: multi-item save flow works"
      ],
      "priority": 15,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-016",
      "title": "Add manual fallback when AI fails",
      "description": "As a user, I want to manually enter item details if AI cannot identify items so the flow never blocks me.",
      "acceptanceCriteria": [
        "Show failure state with clear retry and manual-entry actions",
        "Manual entry opens item editor with selected image prefilled",
        "Cleanup temporary uploads when user cancels flow",
        "Typecheck passes",
        "Verify in iOS simulator: fallback path creates item"
      ],
      "priority": 16,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-017",
      "title": "Build search screen with text query",
      "description": "As a user, I want text search over inventory so I can quickly locate items.",
      "acceptanceCriteria": [
        "Search screen supports debounced text input",
        "Search query checks relevant fields and returns matching items",
        "Result rows navigate to item detail",
        "Typecheck passes",
        "Verify in iOS simulator: search returns expected matches"
      ],
      "priority": 17,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-018",
      "title": "Implement marketplace feed and listing detail",
      "description": "As a user, I want to browse marketplace listings and open details so I can evaluate items.",
      "acceptanceCriteria": [
        "Marketplace tab shows active listings feed",
        "Listing detail page displays seller/item/price/condition context",
        "Add loading, empty, and error states",
        "Typecheck passes",
        "Verify in iOS simulator: feed to detail navigation works"
      ],
      "priority": 18,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-019",
      "title": "Implement my listings management",
      "description": "As a seller, I want to create and manage my listings so I can sell inventory items.",
      "acceptanceCriteria": [
        "Create My Listings screen with active/sold/reserved states",
        "Support create/edit/remove listing actions",
        "Listing state changes are persisted and reflected in UI",
        "Typecheck passes",
        "Verify in iOS simulator: listing lifecycle actions work"
      ],
      "priority": 19,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-020",
      "title": "Implement saved listings",
      "description": "As a buyer, I want to save listings so I can revisit them later.",
      "acceptanceCriteria": [
        "Allow save/unsave action from listing feed/detail",
        "Create Saved Listings screen",
        "Saved state remains consistent after app restart",
        "Typecheck passes",
        "Verify in iOS simulator: saved listings flow works"
      ],
      "priority": 20,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-021",
      "title": "Implement marketplace messages and chat",
      "description": "As a user, I want to message other users from listings so I can coordinate transactions.",
      "acceptanceCriteria": [
        "Messages inbox lists marketplace conversations",
        "Chat screen supports sending and receiving text messages",
        "Unread/read state updates correctly",
        "Typecheck passes",
        "Verify in iOS simulator: send and receive chat messages"
      ],
      "priority": 21,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-022",
      "title": "Implement transaction status flow",
      "description": "As buyer and seller, I want to update transaction status so both sides can track deal progress.",
      "acceptanceCriteria": [
        "Support pending/accepted/completed/cancelled transitions with permission checks",
        "Display current transaction status in listing/chat context",
        "Status updates create corresponding notification records",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 22,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-023",
      "title": "Build in-app notifications center",
      "description": "As a user, I want to view notification history in-app so I can track marketplace and inventory events.",
      "acceptanceCriteria": [
        "Create notifications list screen with unread/read state",
        "Support mark as read action",
        "Notification tap routes to related screen when data exists",
        "Typecheck passes",
        "Verify in iOS simulator: notifications list interactions work"
      ],
      "priority": 23,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-024",
      "title": "Integrate Expo Push permission and token registration",
      "description": "As a user, I want push alerts for key events so I can respond promptly.",
      "acceptanceCriteria": [
        "Request notification permissions with iOS-friendly prompt flow",
        "Register Expo push token and associate it with current user device",
        "Persist and refresh token as needed on app startup",
        "Typecheck passes",
        "Verify in iOS simulator/device: permission flow and token registration succeed"
      ],
      "priority": 24,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-025",
      "title": "Deliver push notifications for core marketplace events",
      "description": "As a user, I want push alerts for inquiries/messages/transaction updates so I do not miss important actions.",
      "acceptanceCriteria": [
        "Map event types: new inquiry, purchase request, request accepted/declined, new message, transaction complete",
        "Send Expo Push payload with deep-link metadata",
        "Foreground and background notification handling routes correctly",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 25,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-026",
      "title": "Apply iOS-native visual system and interaction polish",
      "description": "As a user, I want the app to feel like an iOS-native product rather than a web wrapper.",
      "acceptanceCriteria": [
        "Define mobile design tokens (spacing, typography, radius, color) for iOS style",
        "Use native-style list cells, sheets, segmented controls, and haptics where appropriate",
        "Ensure safe-area and notch handling across common iPhone sizes",
        "Typecheck passes",
        "Verify in iOS simulator: key screens follow native iOS interaction expectations"
      ],
      "priority": 26,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-027",
      "title": "Add quality gates and release readiness checks",
      "description": "As a developer, I need reliable quality checks so the TestFlight build remains stable.",
      "acceptanceCriteria": [
        "Define mobile quality command set (typecheck, lint, tests, Expo build check)",
        "Document release checklist for internal/TestFlight build",
        "Main mobile branch state is green under quality commands",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 27,
      "passes": true,
      "notes": ""
    }
  ]
}
